{
  "backend/main.mo": "Backend actor handling Stripe checkout sessions, access-controlled profile management, and storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping deployment documentation to components and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files for reference.",
  "frontend/DEPLOYMENT.md": "Guide outlining prerequisites and steps to deploy the draft build to production on the Internet Computer.",
  "frontend/index.css": "Tailwind-based global styles defining color variables, theming, and base layout rules.",
  "frontend/index.html": "HTML entry point loading the React app and html2pdf.js for PDF generation.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/Footer.tsx": "Footer with attribution, branding, and a brief description of the app’s purpose.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation, login/logout handling, and mobile menu.",
  "frontend/src/components/InvoicePreview.tsx": "Displays invoice details and enables PDF export using html2pdf.js.",
  "frontend/src/components/Layout.tsx": "Root layout wrapping pages with header, footer, and main content area.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, logout, and restoring identities via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines a mutation hook that uses the actor to create checkout sessions from shopping items.",
  "frontend/src/index.css": "Configures Tailwind base styles, theme variables, dark mode, and utility classes including Indian color variants.",
  "frontend/src/lib/gst.ts": "Computes GST totals, tax percentages, and interstate status based on invoice data.",
  "frontend/src/lib/states.ts": "Exports a list of Indian states and union territories.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/Dashboard.tsx": "Displays user dashboard with subscription status, stats, and recent invoices, requiring authentication.",
  "frontend/src/pages/InvoiceCreator.tsx": "Interactive GST invoice builder supporting item management, validation, and logo upload.",
  "frontend/src/pages/LandingPage.tsx": "Renders the main marketing landing page with hero section, features, and CTAs for creating invoices or viewing pricing.",
  "frontend/src/pages/PaymentFailure.tsx": "Displays a failure message after unsuccessful payment and provides options to retry or return home.",
  "frontend/src/pages/PaymentSuccess.tsx": "Shows a success confirmation for completed payments with navigation to dashboard or invoice creation.",
  "frontend/src/pages/PricingPage.tsx": "Implements the pricing plans UI and triggers a checkout session for the Pro subscription.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme, colors, animations, and plugins with extended design tokens.",
  "project_state.json": "Stores project metadata including features, state version, and project description."
}