{
  "backend/main.mo": "Motoko backend implementing authorization, Stripe checkout/session status calls, user profiles, and blob storage integration.",
  "feature_evidence.json": "Feature-evidence report linking a deployment-related feature to specific files, components, and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose and behavior.",
  "frontend/DEPLOYMENT.md": "Mainnet deployment guide detailing prerequisites, safety checks, identity setup, and DFX steps for production release.",
  "frontend/index.css": "Global Tailwind-based styling with OKLCH color variables, dark mode, component styles, and print rules.",
  "frontend/index.html": "Base HTML document loading the app root and html2pdf.js for PDF generation.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/Footer.tsx": "Footer showing branding attribution and a brief GST Invoice Pro description.",
  "frontend/src/components/Header.tsx": "Responsive header with navigation, login/logout via Internet Identity, and mobile menu handling.",
  "frontend/src/components/InvoicePreview.tsx": "Invoice preview renderer with GST calculations and PDF export using html2pdf.js.",
  "frontend/src/components/Layout.tsx": "Root layout wrapping pages with Header, Footer, and an Outlet for nested routes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, handling login, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines a mutation to create a checkout session by calling the backend actor and returning parsed session data.",
  "frontend/src/index.css": "Tailwind-based global styles defining color variables, themes, and custom utility classes including Indian‑themed colors.",
  "frontend/src/lib/gst.ts": "Calculates GST totals from invoice data, returning subtotal, tax, and interstate status.",
  "frontend/src/lib/states.ts": "Exports a list of Indian states and union territories.",
  "frontend/src/main.tsx": "Initializes the app by mounting React, setting up QueryClient, and wrapping it with the InternetIdentityProvider.",
  "frontend/src/pages/Dashboard.tsx": "Displays an authenticated user dashboard with subscription status, stats, and recent invoices.",
  "frontend/src/pages/InvoiceCreator.tsx": "Provides a form-driven GST invoice creator with item management, validation, and preview support.",
  "frontend/src/pages/LandingPage.tsx": "Implements the marketing landing page with hero content, feature highlights, and CTA buttons for creating invoices or viewing pricing.",
  "frontend/src/pages/PaymentFailure.tsx": "Displays a payment failure message with details and options to retry or return home.",
  "frontend/src/pages/PaymentSuccess.tsx": "Shows a successful payment confirmation and links to the dashboard or invoice creation.",
  "frontend/src/pages/PricingPage.tsx": "Renders free and paid subscription plans and triggers checkout session creation for upgrades.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, colors, animations, and plugins for the project.",
  "project_state.json": "Stores project metadata including versioning, features, and deployment‑related state."
}